000100200402          Dcl-Pr DayNumName Char(9);
000200200402           DayIn Packed(1);
000300181112          End-Pr;
000400181112
000500200406          Dcl-Pr MonthNumName Char(9);
000600200406           MonthIn Packed(2);
000700200406          End-Pr;
000800181112
